---
kind: enumMember
id: F:Autodesk.Revit.DB.ProfilePlaneLocation.MidPoint
enum: Autodesk.Revit.DB.ProfilePlaneLocation
source: html/7ee6064e-ae88-1efe-a030-dabfae9bacaf.htm
---
# Autodesk.Revit.DB.ProfilePlaneLocation.MidPoint

Indicates the profile plane located at the Middle point of the path curve.